In [1]:
import numpy as np
import pandas as pd

In [3]:
file_path  = '/home/vijay/mlprojects/titanic/train.csv'
file_path_1 = '/home/vijay/mlprojects/titanic/test.csv'
train = pd.read_csv(file_path)
test = pd.read_csv(file_path_1)

In [4]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
X = train.drop(['Survived'],axis=1)
y = train.Survived
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [244]:
cat_col = [col for col in X.columns if X[col].dtype == 'object']
numerical_col =  [col for col in X.columns if X[col].dtype in ['int64','float64']]
numerical_col

['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [245]:
train[['Sex', 'Survived']].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

In [246]:
train[['SibSp','Survived']].groupby(['SibSp'],as_index=False).mean().sort_values(by='Survived',ascending=False)

   SibSp  Survived
1      1  0.535885
2      2  0.464286
0      0  0.345395
3      3  0.250000
4      4  0.166667
5      5  0.000000
6      8  0.000000

In [247]:
train[['Parch','Survived']].groupby(['Parch'],as_index=False).mean().sort_values(by='Survived',ascending=False)

   Parch  Survived
3      3  0.600000
1      1  0.550847
2      2  0.500000
0      0  0.343658
5      5  0.200000
4      4  0.000000
6      6  0.000000

In [248]:
train[['Pclass','Survived']].groupby(['Pclass'],as_index=False).mean().sort_values(by='Survived',ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

In [249]:
train[['Embarked','Survived']].groupby(['Embarked'],as_index=False).mean().sort_values(by='Survived',ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.336957

In [250]:
train = train.drop(['Cabin','Ticket'],axis=1)
test = test.drop(['Cabin','Ticket'],axis=1)

In [251]:
combine = [train,test]

In [252]:
for dataset in combine:
  dataset['Title'] = dataset.Name.str.extract('([A-Za-z]+)\.',expand = False)
pd.crosstab(train['Title'], train['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [253]:
for dataset in combine:
  dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
                                               'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'],'Rare')
  dataset['Title'] = dataset['Title'].replace('Mlle','Miss')
  dataset['Title'] = dataset['Title'].replace('Ms','Miss')
  dataset['Title'] = dataset['Title'].replace('Mme','Mrs')

train[['Title','Survived']].groupby(['Title'],as_index = False).mean().sort_values('Survived',ascending = False)

    Title  Survived
3     Mrs  0.793651
1    Miss  0.702703
0  Master  0.575000
4    Rare  0.347826
2      Mr  0.156673

In [254]:
title_mapping = {'Mrs':1,'Miss':2,'Master':3,'Rare':4,'Mr':5}

for dataset in combine:
  dataset['Title'] = dataset['Title'].map(title_mapping).astype('int')
  dataset['Title'] = dataset['Title'].fillna(0)

train.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Title
0            1         0       3  ...   7.2500        S      5
1            2         1       1  ...  71.2833        C      1
2            3         1       3  ...   7.9250        S      2
3            4         1       1  ...  53.1000        S      1
4            5         0       3  ...   8.0500        S      5

[5 rows x 11 columns]

In [255]:
train.drop('Name',axis=1,inplace=True)
test.drop('Name',axis=1,inplace=True)
combine = [train,test]

In [256]:
for dataset in combine:
  dataset['Sex'] = dataset['Sex'].map({'female':1,'male':0}).astype('int')
  
train.head()

   PassengerId  Survived  Pclass  Sex  ...  Parch     Fare  Embarked  Title
0            1         0       3    0  ...      0   7.2500         S      5
1            2         1       1    1  ...      0  71.2833         C      1
2            3         1       3    1  ...      0   7.9250         S      2
3            4         1       1    1  ...      0  53.1000         S      1
4            5         0       3    0  ...      0   8.0500         S      5

[5 rows x 10 columns]

In [257]:
guess_ages = np.zeros((2,3))

In [258]:
for dataset in combine:
  for i in range(0, 2):
    for j in range(0, 3):
      guess_df = dataset[(dataset['Sex'] == i) & \
                         (dataset['Pclass'] == j+1)]['Age'].dropna()

      age_guess = guess_df.median()
      guess_ages[i,j] = int( age_guess/0.5 + 0.5 ) * 0.5
    
  for i in range(0, 2):
    for j in range(0, 3):
      dataset.loc[ (dataset.Age.isnull()) & (dataset.Sex == i) & (dataset.Pclass == j+1),\
                  'Age'] = guess_ages[i,j]
      
dataset['Age'] = dataset['Age'].astype(int)

In [259]:
train['AgeBand'] = pd.cut(train['Age'],5)
train[['AgeBand','Survived']].groupby('AgeBand').mean().sort_values('AgeBand',ascending = False)

                  Survived
AgeBand
(64.084, 80.0]    0.090909
(48.168, 64.084]  0.434783
(32.252, 48.168]  0.412844
(16.336, 32.252]  0.336714
(0.34, 16.336]    0.550000

In [260]:
for dataset in combine:
  dataset.loc[dataset['Age'] <= 16, 'Age'] = 0
  dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 32),'Age'] = 1
  dataset.loc[(dataset['Age'] > 32) & (dataset['Age'] <= 48),'Age'] = 2
  dataset.loc[(dataset['Age'] > 48) & (dataset['Age'] <= 64),'Age'] = 3
  dataset.loc[(dataset['Age'] > 64), 'Age'] = 4


train.head()

   PassengerId  Survived  Pclass  ...  Embarked  Title           AgeBand
0            1         0       3  ...         S      5  (16.336, 32.252]
1            2         1       1  ...         C      1  (32.252, 48.168]
2            3         1       3  ...         S      2  (16.336, 32.252]
3            4         1       1  ...         S      1  (32.252, 48.168]
4            5         0       3  ...         S      5  (32.252, 48.168]

[5 rows x 11 columns]

In [261]:
combine = [train,test]

In [262]:
for dataset in combine:
  dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1

train[['FamilySize','Survived']].groupby('FamilySize').mean()

            Survived
FamilySize
1           0.303538
2           0.552795
3           0.578431
4           0.724138
5           0.200000
6           0.136364
7           0.333333
8           0.000000
11          0.000000

In [263]:
for dataset in combine:
  dataset['IsAlone'] = 0
  dataset.loc[dataset['FamilySize']==1 , 'IsAlone'] = 1

train[['IsAlone','Survived']].groupby('IsAlone').mean()

         Survived
IsAlone
0        0.505650
1        0.303538

In [264]:
train = train.drop(['FamilySize','Parch','SibSp'],axis=1)
test = test.drop(['FamilySize','Parch','SibSp'],axis=1)
combine = [train,test]

In [265]:
for dataset in combine:
  dataset['Age*Pclass'] = dataset['Age'] * dataset['Pclass']

train[['Age*Pclass','Age','Pclass']].head()

   Age*Pclass  Age  Pclass
0         3.0  1.0       3
1         2.0  2.0       1
2         3.0  1.0       3
3         2.0  2.0       1
4         6.0  2.0       3

In [266]:
freq_port = train.Embarked.dropna().mode()[0]
freq_port

'S'

In [267]:
for dataset in combine:
  dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)

train[['Embarked','Survived']].groupby('Embarked').mean()

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.339009

In [268]:
for dataset in combine:
  dataset['Embarked'] = dataset['Embarked'].map({'C':0,'Q':1,'S':2})

train.head()

   PassengerId  Survived  Pclass  ...           AgeBand  IsAlone  Age*Pclass
0            1         0       3  ...  (16.336, 32.252]        0         3.0
1            2         1       1  ...  (32.252, 48.168]        0         2.0
2            3         1       3  ...  (16.336, 32.252]        1         3.0
3            4         1       1  ...  (32.252, 48.168]        0         2.0
4            5         0       3  ...  (32.252, 48.168]        1         6.0

[5 rows x 11 columns]

In [269]:
test['Fare'].fillna(test['Fare'].dropna().median(), inplace=True)

In [272]:
train['FareBand'] = pd.qcut(train['Fare'],4)
train[['FareBand','Survived']].groupby('FareBand').mean()

                 Survived
FareBand
(-0.001, 7.91]   0.197309
(7.91, 14.454]   0.303571
(14.454, 31.0]   0.454955
(31.0, 512.329]  0.581081

In [273]:
for dataset in combine:
  dataset.loc[dataset['Fare'] <= 7.91,'Fare'] = 0
  dataset.loc[(dataset['Fare'] > 7.91) & (dataset['Fare'] <= 14.454),'Fare'] = 1
  dataset.loc[(dataset['Fare'] > 14.454) & (dataset['Fare'] <= 31.0),'Fare'] = 2
  dataset.loc[(dataset['Fare'] > 31.0),'Fare'] = 3

train.head()

   PassengerId  Survived  Pclass  ...  IsAlone  Age*Pclass         FareBand
0            1         0       3  ...        0         3.0   (-0.001, 7.91]
1            2         1       1  ...        0         2.0  (31.0, 512.329]
2            3         1       3  ...        1         3.0   (7.91, 14.454]
3            4         1       1  ...        0         2.0  (31.0, 512.329]
4            5         0       3  ...        1         6.0   (7.91, 14.454]

[5 rows x 12 columns]

In [274]:
train = train.drop(['AgeBand','FareBand'],axis=1)
train.head()

   PassengerId  Survived  Pclass  Sex  ...  Embarked  Title  IsAlone  Age*Pclass
0            1         0       3    0  ...         2      5        0         3.0
1            2         1       1    1  ...         0      1        0         2.0
2            3         1       3    1  ...         2      2        1         3.0
3            4         1       1    1  ...         2      1        0         2.0
4            5         0       3    0  ...         2      5        1         6.0

[5 rows x 10 columns]

In [275]:
test.head()

   PassengerId  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone  Age*Pclass
0          892       3    0    2   0.0         1      5        1           6
1          893       3    1    2   0.0         2      1        0           6
2          894       2    0    3   1.0         1      5        1           6
3          895       3    0    1   1.0         2      5        1           3
4          896       3    1    1   1.0         2      1        0           3

In [292]:

train.set_index('PassengerId',inplace=True)
test.set_index('PassengerId',inplace=True)
feature_col = train.drop('Survived',axis=1).columns
feature_col

Index(['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Title', 'IsAlone',
       'Age*Pclass'],
      dtype='object')

In [293]:
import lightgbm as lgb
from sklearn.model_selection import train_test_split
from sklearn import metrics

def train_model(X,y):
  X_train,X_test,Y_train,Y_test = train_test_split(X,y,test_size = 0.1,random_state = 1) 
  dtrain = lgb.Dataset(X_train,label=Y_train)
  dvalid = lgb.Dataset(X_test,label=Y_test)
  param = {'num_leaves': 64, 'objective': 'binary','metric': 'auc', 'seed': 7}
  n_round = 1000
  bst = lgb.train(param,dtrain,n_round,valid_sets=[dvalid],early_stopping_rounds = 20,verbose_eval=False)
  y_pre = bst.predict(X_test)
  score_ = metrics.roc_auc_score(Y_test,y_pre)  
  return bst,score_

In [295]:
model,score = train_model(train[feature_col],train['Survived'])

In [296]:
score

0.8689444161142275

In [339]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
model_ = RandomForestClassifier(n_estimators=400,random_state=1)
train_X,test_X,train_y,test_y = train_test_split(train[feature_col],train['Survived'],test_size = 0.3,random_state = 0)
model_.fit(train_X,train_y)
score_ = model_.score(test_X,test_y)
score_

0.8395522388059702

In [304]:
train.head()

             Survived  Pclass  Sex  Age  ...  Embarked  Title  IsAlone  Age*Pclass
PassengerId                              ...
1                   0       3    0  1.0  ...         2      5        0         3.0
2                   1       1    1  2.0  ...         0      1        0         2.0
3                   1       3    1  1.0  ...         2      2        1         3.0
4                   1       1    1  2.0  ...         2      1        0         2.0
5                   0       3    0  2.0  ...         2      5        1         6.0

[5 rows x 9 columns]

In [312]:
y_p = model_.predict(test)

In [313]:
df_1 = pd.DataFrame({'PassengerId':test.index,'Survived':y_p})

In [314]:
df = pd.DataFrame()
df['PassengerId']=df_1['PassengerId'].astype('int32')
df['Survived']=df_1['Survived'].astype('int32')
df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [315]:
df.to_csv('Submition_1.csv',index=False)

In [ ]:
df.dtypes

In [ ]:
_=X.join(y)

In [ ]:
_.corr()